gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
// select http url to send to:
//  - send to Bplaced or an internal device
//  - select if it is a live system or development
#if isLiveSystem == 1
const char *sendHttpTo = "https://zehentner.bplaced.net/Wasserstand/live/data_sql.php"; // the module will send information to that server/resource. Use an URI or an IP address
#else
const char *sendHttpTo = "https://zehentner.bplaced.net/Wasserstand/dev/data_sql.php"; // the module will send information to that server/resource. Use an URI or an IP address
#endif

int alarmStateRelais = 0;    // actual state of alarm derived from relais
int alarmStateRelaisOld = 0; // previous value of alarmStateRelais
int alarmStateLevel = 0;     // actual state of alarm derived from measured water level
int alarmStateLevelOld = 0;  // previous value of alarmStateLevel
int alarmState = 0;          // worst case value of both alarmState
                             //   5 : pump running
                             //   4 : severe warning
                             //   3 : normal high
                             //   2 : normal
                             //   1 : normal low
int alarmStateOld = 0;       // previous value of alarmState
bool executeSendMail = false;

int debugLevelSwitches_old = 0;
String receivedString = "";

char input[64];
bool inputReadingCompleted = false;

long lastMillis = 0;
int timeTickForCyclicPrint = 0;

int doPrint = 0;
int value = 0;

//* ============================================================= */
/* Definition for Send-Mail                                      */

/* settings for GMAIL */
#define SMTP_HOST "smtp.gmail.com"
#define SMTP_PORT esp_mail_smtp_port_587 // port 465 is not available for Outlook.com

/* The log in credentials */
#define AUTHOR_NAME "Pegelstand Zehentner"
#define AUTHOR_EMAIL "georgzehentneresp@gmail.com"
#define AUTHOR_PASSWORD "lwecoyvlkmordnly"

/* Recipient email address */
#define RECIPIENT_EMAIL_LIVE "gzehentner@web.de"
#define RECIPIENT_EMAIL_DEV "gzehentner@t-online.de"

#if isLiveSystem == 1
#define RECIPIENT_EMAIL RECIPIENT_EMAIL_LIVE
#else
#define RECIPIENT_EMAIL RECIPIENT_EMAIL_DEV
#endif

/* Declare the global used SMTPSession object for SMTP transport */
SMTPSession smtp;

Session_Config config;

/* Callback function to get the Email sending status */
void smtpCallback(SMTP_Status status);

#include "HeapStat.h"
HeapStat heapInfo;

// GZE: I dont know what this par of code does
extern char _end;
#if BOARDTYPE == ESP8266
extern "C" char *sbrk(int i);
#endif

char *ramstart = (char *)0x20070000;
char *ramend = (char *)0x20088000;

// const char rootCACert[] PROGMEM = "-----BEGIN CERTIFICATE-----\n"
//                                   "-----END CERTIFICATE-----\n";
/* END Definition for Send-Mail                                      */
/* ============================================================= */

/* *******************************************************************
         other settings / weitere Einstellungen für den Anwender
 ********************************************************************/

#ifndef STASSID                // either use an external .h file containing STASSID and STAPSK or ...
#define STASSID "Zehentner"    // ... modify these line to your SSID
#define STAPSK "ElisabethScho" // ... and set your WIFI password
#endif

const char *ssid = STASSID;
const char *password = STAPSK;

String phoneNumber = "+491607547424";
String apiKey = "6878208";

WiFiUDP ntpUDP;

#ifndef CSS_MAINCOLOR
#define CSS_MAINCOLOR "#8A0829" // fallback if no CSS_MAINCOLOR was declared for the board
#endif

/*=================================================================*/
/*  Prepare analog out        */
/*=================================================================*/

//--------------- fading LED not used for simulation
//
// fade LED PIN (replace with LED_BUILTIN constant for built-in LED)
// #define LED_PIN            builtin_led

// float dutycylce  = 0;              // how bright the LED is

// float fadeAmount = 0.0001;         // how many m to fade the LED by

//--------------------------------------------------------------------

unsigned long previousMillisCyclicPrint;
unsigned long WaitingTimeCyclicPrint = 1000;

unsigned long previousMillis_halfSecondAction;
unsigned long halfSecond;

void flushInput()
{
  for (int i = 0; i < 64; i++)
  {
    input[i] = {};
  }
}

void debugPrintCyclic(int index, long WaitingTimeCyclicPrint, String printText, int newline, long printValue)
{
  static long previousMillisCyclicPrint[20] = {0};

  // print some debug information cyclic
  if (millis() - previousMillisCyclicPrint[index] > WaitingTimeCyclicPrint)
  {
    previousMillisCyclicPrint[index] = millis();

    Serial.print(printText);
    Serial.print(printValue);
    if (newline)
    {
      Serial.println();
    }
    else
    {
      Serial.print(" ");
    }
  }
} // end of debugPrintCyclic

MeasureRuntime measureSensor = {0, 0, 0};
MeasureRuntime measureLoopOthers = {0, 0, 0};
MeasureRuntime measureLoopAll = {0, 0, 0};

void measureRuntimeStart(MeasureRuntime &measureRuntime)
{
  measureRuntime.startTime = millis();
}

void measureRuntimeEnd(MeasureRuntime &measureRuntime)
{
  measureRuntime.runTime = millis() - measureRuntime.startTime;

  if (measureRuntime.runTime > measureRuntime.maxDelta)
  {
    measureRuntime.maxDelta = measureRuntime.runTime;
  }
}

//===================================================================*/
// variables for toplevel
PumpStatus pumpStatus = {0, 0, 0};      // create a PumpStatus object to manage pump states
PumpControl pumpControl = {0, 0, 0, 0}; // create a PumpControl object to manage pump operations
//===================================================================*/

/*****************************************************************************************************************
 *****************************************************************************************************************
         S E T U P
 *****************************************************************************************************************
 *****************************************************************************************************************/

void setup(void)
{

#if BOARDTYPE == ESP32
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // disable brownout detector
#endif

  pinMode(builtin_led, OUTPUT);

