gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
    getSetupIni(pumpStatus);
    // readFile("/setup.ini");
    Serial.println();
    Serial.print("pump1_operationTime : ");
    Serial.println(pumpStatus.pump1_operationTime);
    Serial.print("pump2_operationTime : ");
    Serial.println(pumpStatus.pump2_operationTime);
    Serial.print("linkPump            : ");
    Serial.println(pumpStatus.linkPump);

//=============================================================================================
// handling error lot
//=============================================================================================
#if deleteErrLog == 1
    // deleting setupFile
    Serial.println("deleting error.log");
    deleteFile("/error.log");
#else
    Serial.println("NOT!!! deleting error.log");
#endif
    if (!LittleFS.exists("/error.log"))
    {
      Serial.println("error.log doesnt exist; generating a new one");

      String errMessage = "";
      errMessage = currentDate;
      errMessage += " - ";
      errMessage += formattedTime;
      errMessage += " - ";
      errMessage += "init error-file\n";
      appendFile("/error.log", errMessage.c_str());
    }

    readFile("/error.log");
  }

  // listDir("/");

  // write reboot reason if not normal

  if ((resetReason != ESP_RST_POWERON) && (resetReason != ESP_RST_SW))
  {
    // write the reboot reason to the error log
    Serial.println("Writing reboot reason to error.log");

    // get current time and date
    getEpochTime(epochTime);
    formatDateAndTime(formattedTime, currentDate, epochTime);

    // write the reboot reason to the error log
    String errMessage = "";
    errMessage = currentDate;
    errMessage += " - ";
    errMessage += formattedTime;
    errMessage += " - ";
    errMessage += "Reboot reason: ";
    errMessage += resetReason;
    errMessage += "\n";
    appendFile("/error.log", errMessage.c_str());

  } // end of if resetReason != ESP_RST_POWERON

  // Initialize the Watchdog Timer
  esp_task_wdt_init(WDT_TIMEOUT, true);  // Enable panic so ESP32 resets
  esp_task_wdt_add(NULL);  // Add the current task (loop) to the Watchdog

}
  

/*****************************************************************************************************************
 *****************************************************************************************************************
         M A I N L O O P
 *****************************************************************************************************************
 *****************************************************************************************************************/

void loop(void)
{

  measureRuntimeEnd(measureLoopAll);
  measureRuntimeEnd(measureLoopOthers);

  measureRuntimeStart(measureLoopAll);

  // Reset the Watchdog Timer at the beginning of each loop iteration
  if (simTimeout == 1)
  {
    delay((WDT_TIMEOUT + 1) * 1000); // wait for WDT_TIMEOUT plus 1 second to simulate a timeout
    simTimeout = 0;                  // reset the timeout flag
  }
  esp_task_wdt_reset();

  // **************************************************************************************************
  // ===============================================================================
  // following actions are triggered every 500 ms
  if (millis() - previousMillis_halfSecondAction > halfSecond)
  {

    /*=================================================================*/
    /*  code for getting time from NTP       */
    getEpochTime(epochTime);
    formatDateAndTime(formattedTime, currentDate, epochTime);
    /* End getting time and date */

    previousMillis_halfSecondAction = millis();
  }
  // ===============================================================================
  // **************************************************************************************************

  // ============================================================================
  // In simulation mode:
  //       Simulate level and relais outputs
  //
  //  GZE shift to a separat file
  // ============================================================================
  if (debugLevelSwitches != debugLevelSwitches_old)
  {
    if (debugLevelSwitches == 1)
    {
      // set default values to last actual values, when debug is switched on
      Serial.print("val_AHHH: ");
      Serial.println(val_AHHH);
      Serial.print("val_AHH:  ");
      Serial.println(val_AHH);
      Serial.print("val_AH:   ");
      Serial.println(val_AH);
      Serial.print("val_AL:   ");
      Serial.println(val_AL);
      // simVal_AHHH = val_AHHH;
      simVal_AHH = val_AHH;
      simVal_AH = val_AH;
      simVal_AL = val_AL;
      pinMode(GPin_AHHH, OUTPUT);
      pinMode(GPin_AHH, OUTPUT);
      pinMode(GPin_AH, OUTPUT);
      pinMode(GPin_AL, OUTPUT);

      // digitalWrite(GPin_AHHH, simVal_AHHH);
      digitalWrite(GPin_AHH, simVal_AHH);
      digitalWrite(GPin_AH, simVal_AH);
      digitalWrite(GPin_AL, simVal_AL);
      Serial.println("debug level enabled");
    }
    else
    {
      pinMode(GPin_AHHH, INPUT_PULLUP);
      pinMode(GPin_AHH, INPUT_PULLUP);
      pinMode(GPin_AH, INPUT_PULLUP);
      pinMode(GPin_AL, INPUT_PULLUP);
      Serial.println("debug level disabled");
    }
  }
  debugLevelSwitches_old = debugLevelSwitches;

  // **************************************************************************************************
  // **************************************************************************************************
  /* WebClient */

  seconds_since_startup = millis() / 1000;
  if ((clientIntervall > 0 && (seconds_since_startup - clientPreviousSs) >= clientIntervall)) // || (printOnChangeActive==1))
  {
    // sendPostToAskSensors(); // subscription cancelled

    if ((sendToClient == 1))
    {
      if (valueStable > 0)
      {
        sendPost(pumpStatus, pumpControl);
        // sendPost_V2();
      }
    }
    clientPreviousSs = seconds_since_startup;
  }
  server.handleClient();
  ElegantOTA.loop();

  // **************************************************************************************************
  // **************************************************************************************************
  /* evaluate water level */
  // **************************************************************************************************

