gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
  measureRuntimeStart(measureSensor);
  Current2Waterlevel();
  measureRuntimeEnd(measureSensor);

  SetAlarmState_from_relais();
  SetAlarmState_from_level();
  calculateWorstCaseAlarmState();

  prepareSendMail();

  // **************************************************************************************************
  // **************************************************************************************************
  /* Send Email reusing session   */
  // **************************************************************************************************

  if (executeSendMail)
  {
    SMTP_Message message;

    /* The attachment data item */
    SMTP_Attachment att[2];
    int attIndex = 0;
    // GZE  weitere Definitionen siehe ESP Mail Client/ examples / SMTP / Send_attachment_File

    message.sender.name = F("Pegel Zehentner");
    message.sender.email = AUTHOR_EMAIL;
    message.subject = subject;

    // somtimes we want to use web.de for test, because t-online has a huge delay
    if (useLiveMail == 1)
    {
      message.addRecipient(F("Schorsch"), RECIPIENT_EMAIL_LIVE);
    }
    else
    {
      message.addRecipient(F("Schorsch"), RECIPIENT_EMAIL);
    }

    // htmlMsg already set by Evaluate Sensor
    message.html.content = htmlMsg;
    message.text.content = F("");

    Serial.println();
    Serial.println(F("Sending Email..."));

    if (!smtp.isLoggedIn())
    {
      /* Set the TCP response read timeout in seconds */
      smtp.setTCPTimeout(10);

      if (!smtp.connect(&config))
      {
        MailClient.printf("Connection error, Status Code: %d, Error Code: %d, Reason: %s\n", smtp.statusCode(), smtp.errorCode(), smtp.errorReason().c_str());
        goto exit;
      }

      if (!smtp.isLoggedIn())
      {
        Serial.println(F("Error, Not yet logged in."));
        goto exit;
      }
      else
      {
        if (smtp.isAuthenticated())
          Serial.println(F("Successfully logged in."));
        else
          Serial.println(F("Connected with no Auth."));
      }
    }

    if (!MailClient.sendMail(&smtp, &message, false))
      MailClient.printf("Error, Status Code: %d, Error Code: %d, Reason: %s\n", smtp.statusCode(), smtp.errorCode(), smtp.errorReason().c_str());

    // Send WhatsApp message
    if (executeSendMail)
    {
      Serial.println("Sending WhatsApp message");
      sendWhatsAppMessage(textMsg);
    };

  exit:

    heapInfo.collect();
    heapInfo.print();

    /*=END Send_Reuse_Session =====================================*/
  }

// **************************************************************************************************
// **************************************************************************************************
/*===========================================================
  simulate changing waterlevel
 */
#ifdef SIM_FADING_LEVEL
  // change the dutycylce for next time through the loop:
  pegel = pegel + fadeAmount;

  // reverse the direction of the fading at the ends of the fade:
  if (pegel <= Level_ALL / 100.0 - 0.05 || pegel >= Level_AHH / 100.0 + 0.05)
  {
    fadeAmount = -fadeAmount;
  }
#endif // SIM_FADING_LEVEL
// **************************************************************************************************

// **************************************************************************************************
#ifdef DEBUG_PRINT_RAW
  // **************************************************************************************************
  if (millis() - previousMillisCyclicPrint > WaitingTimeCyclicPrint)
  {

    /*=================================================================*/
    // read analog value via I2C for debug
    // not used in live system
    //===========================================
    const int loc_maxAdc_value = 0x7FFF;
    float voltage = 0.0;

    Serial.println("=================================");
    adc0 = GET_ANALOG;
    // adc0 = ads.readADC_Differential_0_1();
    Serial.print("Analog input pin 0: ");
    Serial.println(adc0);
    Serial.print("myValueFiltered: ");
    Serial.println(myValueFiltered);

    // voltage = ads.computeVolts(adc0);
    // Serial.print("Voltage: "); Serial.println(voltage);

    previousMillisCyclicPrint = millis();
  }
#endif // DEBUG_PRINT_RAW
       // **************************************************************************************************

  // generate a time tick for cyclic operations; e.g. debug print, but also blink LED
  if (millis() - previousMillisCyclicPrint > WaitingTimeCyclicPrint)

  {
    timeTickForCyclicPrint = 1;

    previousMillisCyclicPrint = millis();
  }
  else
  {
    timeTickForCyclicPrint = 0;
  }

// **************************************************************************************************
#ifdef DEBUG_PRINT_CYCLIC
  // **************************************************************************************************
  // Serial.print(formattedTime);
  // heapInfo.collect();
  // heapInfo.print();

  // Serial.print("millisNow : ");Serial.print(opTime_millisNow);Serial.print(" millisDiff : ");Serial.println(opTime_millisDiff);
  //  Serial.print(myValueFilteredAct);
  //  Serial.print(" - AlarmStateLevel: "); Serial.print(alarmStateLevel);
  //  Serial.print("  ");
  //  Serial.print("  pumpA: "); Serial.print(pumpA_op); Serial.print("  Op time 1 : "); Serial.print(pump1_operationTime);
  //  Serial.print("  pumpB: "); Serial.print(pumpB_op); Serial.print("  Op time 2 : "); Serial.print(pump2_operationTime);
  //  Serial.print(" linkPump : ");Serial.println(linkPump);
  if (timeTickForCyclicPrint == 1)
  {
  }

#endif

  if (timeTickForCyclicPrint == 1)
  {
    if (digitalRead(builtin_led) == HIGH)
    {
      digitalWrite(builtin_led, LOW);
    }
    else
    {
      digitalWrite(builtin_led, HIGH);
    }
  }

  controlPump(pumpControl);
  measureOperatingTime(pumpStatus, pumpControl);
  selectPump(pumpStatus, pumpControl);

  // input command via serial interface
  //**************************************************************************************

  millisNow = millis();

  if (millisNow - lastMillis >= 2000)
  {
    lastMillis = millisNow;
    doPrint = 1;

    // Serial.println(".");
    value++;
  }

