gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
  // serial input is not yet working reliably
#ifdef useSerialInput
  // if there's any serial available, read it:
  if (Serial.available() > 0)
  {

    receivedString = Serial.readString();

    Serial.println();
    Serial.println("rec: " + receivedString) + "---";
    Serial.println(";");

    Serial.println("len: " + (receivedString.length()));

    if (receivedString == "r")
    {
      Serial.println("executing readFile");
    }
  }
#endif // useSerialInput

  // **************************************************************************************************
  // set a delay to avoid ESP is busy all the time
  //     allow the cpu to switch to other tasks

  delay(2);

  doPrint = 0;
  printOnChangeActive = 0;

  // **************************************************************************************************
  // measure max latency for loop run
  // **************************************************************************************************
  // get actual timestamp
  millisNowLoopRuntime = millis();
  // calculate actual loopRuntime
  actLoopRuntime = millisNowLoopRuntime - previousMillisLoopRuntime;

  // if actual loopRuntime is greater than max, this is the new max
  if (actLoopRuntime > maxLoopRuntime)
  {
    maxLoopRuntime = actLoopRuntime;
  }

  // remember actual timestamp as previous
  previousMillisLoopRuntime = millisNowLoopRuntime;

  measureRuntimeStart(measureLoopOthers);

  // **************************************************************************************************
  // **************************************************************************************************
} // end void loop()
  // **************************************************************************************************
  // **************************************************************************************************

/* Callback function to get the Email sending status */
void smtpCallback(SMTP_Status status)
{

  Serial.println(status.info());

  if (status.success())
  {

    Serial.println(F("----------------"));
    MailClient.printf("Message sent success: %d\n", status.completedCount());
    MailClient.printf("Message sent failed: %d\n", status.failedCount());
    Serial.println(F("----------------\n"));

    for (size_t i = 0; i < smtp.sendingResult.size(); i++)
    {
      SMTP_Result result = smtp.sendingResult.getItem(i);

      MailClient.printf("Message No: %d\n", i + 1);
      MailClient.printf("Status: %s\n", result.completed ? "success" : "failed");
      MailClient.printf("Date/Time: %s\n", MailClient.Time.getDateTimeString(result.timestamp, "%B %d, %Y %H:%M:%S").c_str());
      MailClient.printf("Recipient: %s\n", result.recipients.c_str());
      MailClient.printf("Subject: %s\n", result.subject.c_str());
    }
    Serial.println("----------------\n");

    smtp.sendingResult.clear();
  }
}

//*******************************************************************************
// read values out of setup.ini
void getSetupIni(PumpStatus &pumpStatus)
//*******************************************************************************
{
  // check if file exists, if not, generate one with zero values
  if (!LittleFS.exists("/setup.ini"))
  {
    Serial.println("setup.ini does not exist / generate a new file");
    Serial.println("Calling putSetupIni");
    putSetupIni(pumpStatus);
  }
  // open file for reading
  File file = LittleFS.open("/setup.ini", "r");
  if (!file)
  {
    Serial.println("Failed to open setup.ini for reading");
    return;
  }
  else
  {
    Serial.println("setup.ini successfully opened for reading");
  }

  // read from file line by line
  // prepare loop
  // define locals
  char c;
  String FileContent = "";
  String fileLine = "";
  int isToken = 1;
  String tokenName = "";
  String tokenValue = "";

  while (file.available())
  {

    c = file.read();

    if (c == '\n')
    {
      // with every new line decode setting
      if (tokenName == "pump1_operationTime")
      {
        pumpStatus.pump1_operationTime = tokenValue.toInt();
      }
      if (tokenName == "pump2_operationTime")
      {
        pumpStatus.pump2_operationTime = tokenValue.toInt();
      }
      if (tokenName == "linkPump")
      {
        pumpStatus.linkPump = tokenValue.toInt();
      }

      // and prepare for next line
      isToken = 1;
      tokenName = "";
      tokenValue = "";
    }
    else if (c == '=')
    {
      // with every equ switch to value
      isToken = 0;
    }
    else if (c == ' ')
    {
      // space: do nothing
    }
    else
    {

      // get char and add to appropriate string
      if (isToken == 1)
      {
        tokenName += c;
      }
      else
      {
        tokenValue += c;
      }
    }
    // noValues ++;
  }
  file.close();
}
//*******************************************************************************
// write values to setup.ini
void putSetupIni(PumpStatus &pumpStatus)
//*******************************************************************************
{
  Serial.println("putSetupIni entered");
  String tempString = "";

  tempString += String("pump1_operationTime=");
  tempString += String(pumpStatus.pump1_operationTime);
  tempString += String(";\npump2_operationTime=");
  tempString += String(pumpStatus.pump2_operationTime);
  tempString += String(";\nlinkPump=");
  tempString += String(pumpStatus.linkPump);
  tempString += String(";\n");

  writeFile("/setup.ini", (tempString).c_str()); // Append data to the file
  Serial.println("data appended");
}
